# LinkedIn Job Postings Dataset - Data Exploration
## Dataset Overview and Schema Analysis

In [4]:
import kagglehub
import pandas as pd
import os

# Download latest version
path = kagglehub.dataset_download("arshkon/linkedin-job-postings")
print("Path to dataset files:", path)

Path to dataset files: /Users/I550202/.cache/kagglehub/datasets/arshkon/linkedin-job-postings/versions/13

## 1. Explore All Available Tables

The dataset contains the following files:

### Main Table:
- **postings.csv** - Main job postings data

### Company-related Tables:
- **companies/companies.csv** - Company information
- **companies/company_industries.csv** - Industries for each company
- **companies/company_specialities.csv** - Company specialties
- **companies/employee_counts.csv** - Employee count ranges

### Job-related Tables:
- **jobs/benefits.csv** - Job benefits
- **jobs/job_industries.csv** - Industries for each job posting
- **jobs/job_skills.csv** - Skills required for each job
- **jobs/salaries.csv** - Salary information

### Mapping/Lookup Tables:
- **mappings/industries.csv** - Industry reference table
- **mappings/skills.csv** - Skills reference table

In [5]:
# Set the base path
base_path = path

## 2. Load and Examine Each Table

### 2.1 Main Postings Table

In [6]:
# Load main postings table
postings = pd.read_csv(os.path.join(base_path, 'postings.csv'))
print(f"Postings shape: {postings.shape}")
print(f"\nColumns: {list(postings.columns)}")
print(f"\nFirst few rows:")
postings.head()

Postings shape: (123849, 31)

Columns: ['job_id', 'company_name', 'title', 'description', 'max_salary', 'pay_period', 'location', 'company_id', 'views', 'med_salary', 'min_salary', 'formatted_work_type', 'applies', 'original_listed_time', 'remote_allowed', 'job_posting_url', 'application_url', 'application_type', 'expiry', 'closed_time', 'formatted_experience_level', 'skills_desc', 'listed_time', 'posting_domain', 'sponsored', 'work_type', 'currency', 'compensation_type', 'normalized_salary', 'zip_code', 'fips']

First few rows:

,job_id,company_name,title,description,max_salary,pay_period,location,company_id,views,med_salary,...,skills_desc,listed_time,posting_domain,sponsored,work_type,currency,compensation_type,normalized_salary,zip_code,fips
0,921716,Corcoran Sawyer Smith,Marketing Coordinator,Job descriptionA leading real estate firm in N...,20.0,HOURLY,"Princeton, NJ",2774458.0,20.0,NaN,...,Requirements: \n\nWe are seeking a College or ...,1.713398e+12,NaN,0,FULL_TIME,USD,BASE_SALARY,38480.0,8540.0,34021.0
1,1829192,NaN,Mental Health Therapist/Counselor,"At Aspen Therapy and Wellness , we are committ...",50.0,HOURLY,"Fort Collins, CO",NaN,1.0,NaN,...,NaN,1.712858e+12,NaN,0,FULL_TIME,USD,BASE_SALARY,83200.0,80521.0,8069.0
2,10998357,The National Exemplar,Assitant Restaurant Manager,The National Exemplar is accepting application...,65000.0,YEARLY,"Cincinnati, OH",64896719.0,8.0,NaN,...,We are currently accepting resumes for FOH - A...,1.713278e+12,NaN,0,FULL_TIME,USD,BASE_SALARY,55000.0,45202.0,39061.0
3,23221523,"Abrams Fensterman, LLP",Senior Elder Law / Trusts and Estates Associat...,Senior Associate Attorney - Elder Law / Trusts...,175000.0,YEARLY,"New Hyde Park, NY",766262.0,16.0,NaN,...,This position requires a baseline understandin...,1.712896e+12,NaN,0,FULL_TIME,USD,BASE_SALARY,157500.0,11040.0,36059.0
4,35982263,NaN,Service Technician,Looking for HVAC service tech with experience ...,80000.0,YEARLY,"Burlington, IA",NaN,3.0,NaN,...,NaN,1.713452e+12,NaN,0,FULL_TIME,USD,BASE_SALARY,70000.0,52601.0,19057.0

In [7]:
# Data types and missing values
print("Postings - Data Info:")
postings.info()

Postings - Data Info:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 123849 entries, 0 to 123848
Data columns (total 31 columns):
 #   Column                      Non-Null Count   Dtype
---  ------                      --------------   -----
 0   job_id                      123849 non-null  int64
 1   company_name                122130 non-null  object
 2   title                       123849 non-null  object
 3   description                 123842 non-null  object
 4   max_salary                  29793 non-null   float64
 5   pay_period                  36073 non-null   object
 6   location                    123849 non-null  object
 7   company_id                  122132 non-null  float64
 8   views                       122160 non-null  float64
 9   med_salary                  6280 non-null    float64
 10  min_salary                  29793 non-null   float64
 11  formatted_work_type         123849 non-null  object
 12  applies                     23320 non-null   float64
 13  original_listed_time        123849 non-null  float64
 14  remote_allowed              15246 non-null   float64
 15  job_posting_url             123849 non-null  object
 16  application_url             87184 non-null   object
 17  application_type            123849 non-null  object
 18  expiry                      123849 non-null  float64
 19  closed_time                 1073 non-null    float64
 20  formatted_experience_level  94440 non-null   object
 21  skills_desc                 2439 non-null    object
 22  listed_time                 123849 non-null  float64
 23  posting_domain              83881 non-null   object
 24  sponsored                   123849 non-null  int64
 25  work_type                   123849 non-null  object
 26  currency                    36073 non-null   object
 27  compensation_type           36073 non-null   object
 28  normalized_salary           36073 non-null   float64
 29  zip_code                    102977 non-null  float64
 30  fips                        96434 non-null   float64
dtypes: float64(14), int64(2), object(15)
memory usage: 29.3+ MB

### 2.2 Company Tables

In [8]:
# Companies
companies = pd.read_csv(os.path.join(base_path, 'companies/companies.csv'))
print(f"Companies shape: {companies.shape}")
print(f"Columns: {list(companies.columns)}")
companies.head()

Companies shape: (24473, 10)
Columns: ['company_id', 'name', 'description', 'company_size', 'state', 'country', 'city', 'zip_code', 'address', 'url']

,company_id,name,description,company_size,state,country,city,zip_code,address,url
0,1009,IBM,"At IBM, we do more than work. We create. We cr...",7.0,NY,US,"Armonk, New York",10504,International Business Machines Corp.,https://www.linkedin.com/company/ibm
1,1016,GE HealthCare,Every day millions of people feel the impact o...,7.0,0,US,Chicago,0,-,https://www.linkedin.com/company/gehealthcare
2,1025,Hewlett Packard Enterprise,Official LinkedIn of Hewlett Packard Enterpris...,7.0,Texas,US,Houston,77389,1701 E Mossy Oaks Rd Spring,https://www.linkedin.com/company/hewlett-packa...
3,1028,Oracle,We’re a cloud technology company that provides...,7.0,Texas,US,Austin,78741,2300 Oracle Way,https://www.linkedin.com/company/oracle
4,1033,Accenture,Accenture is a leading global professional ser...,7.0,0,IE,Dublin 2,0,Grand Canal Harbour,https://www.linkedin.com/company/accenture

In [9]:
# Company Industries
company_industries = pd.read_csv(os.path.join(base_path, 'companies/company_industries.csv'))
print(f"Company Industries shape: {company_industries.shape}")
print(f"Columns: {list(company_industries.columns)}")
company_industries.head()

Company Industries shape: (24375, 2)
Columns: ['company_id', 'industry']

   company_id                        industry
0      391906  Book and Periodical Publishing
1    22292832                    Construction
2       20300                         Banking
3     3570660  Book and Periodical Publishing
4      878353         Staffing and Recruiting

In [10]:
# Company Specialities
company_specialities = pd.read_csv(os.path.join(base_path, 'companies/company_specialities.csv'))
print(f"Company Specialities shape: {company_specialities.shape}")
print(f"Columns: {list(company_specialities.columns)}")
company_specialities.head()

Company Specialities shape: (169387, 2)
Columns: ['company_id', 'speciality']

   company_id              speciality
0    22292832      window replacement
1    22292832  patio door replacement
2       20300      Commercial Banking
3       20300          Retail Banking
4       20300                Mortgage

In [11]:
# Employee Counts
employee_counts = pd.read_csv(os.path.join(base_path, 'companies/employee_counts.csv'))
print(f"Employee Counts shape: {employee_counts.shape}")
print(f"Columns: {list(employee_counts.columns)}")
employee_counts.head()

Employee Counts shape: (35787, 4)
Columns: ['company_id', 'employee_count', 'follower_count', 'time_recorded']

   company_id  employee_count  follower_count  time_recorded
0      391906             186           32508     1712346173
1    22292832             311            4471     1712346173
2       20300            1053            6554     1712346173
3     3570660             383           35241     1712346173
4      878353              52           26397     1712346173

### 2.3 Job Tables

In [12]:
# Benefits
benefits = pd.read_csv(os.path.join(base_path, 'jobs/benefits.csv'))
print(f"Benefits shape: {benefits.shape}")
print(f"Columns: {list(benefits.columns)}")
benefits.head()

Benefits shape: (67943, 3)
Columns: ['job_id', 'inferred', 'type']

       job_id  inferred                     type
0  3887473071         0        Medical insurance
1  3887473071         0         Vision insurance
2  3887473071         0         Dental insurance
3  3887473071         0                   401(k)
4  3887473071         0  Student loan assistance

In [13]:
# Job Industries
job_industries = pd.read_csv(os.path.join(base_path, 'jobs/job_industries.csv'))
print(f"Job Industries shape: {job_industries.shape}")
print(f"Columns: {list(job_industries.columns)}")
job_industries.head()

Job Industries shape: (164808, 2)
Columns: ['job_id', 'industry_id']

       job_id  industry_id
0  3884428798           82
1  3887473071           48
2  3887465684           41
3  3887467939           82
4  3887467939           80

In [14]:
# Job Skills
job_skills = pd.read_csv(os.path.join(base_path, 'jobs/job_skills.csv'))
print(f"Job Skills shape: {job_skills.shape}")
print(f"Columns: {list(job_skills.columns)}")
job_skills.head()

Job Skills shape: (213768, 2)
Columns: ['job_id', 'skill_abr']

       job_id skill_abr
0  3884428798      MRKT
1  3884428798        PR
2  3884428798       WRT
3  3887473071      SALE
4  3887465684       FIN

In [15]:
# Salaries
salaries = pd.read_csv(os.path.join(base_path, 'jobs/salaries.csv'))
print(f"Salaries shape: {salaries.shape}")
print(f"Columns: {list(salaries.columns)}")
salaries.head()

Salaries shape: (40785, 8)
Columns: ['salary_id', 'job_id', 'max_salary', 'med_salary', 'min_salary', 'pay_period', 'currency', 'compensation_type']

,salary_id,job_id,max_salary,med_salary,min_salary,pay_period,currency,compensation_type
0,1,3884428798,NaN,20.0,NaN,HOURLY,USD,BASE_SALARY
1,2,3887470552,25.0,NaN,23.0,HOURLY,USD,BASE_SALARY
2,3,3884431523,120000.0,NaN,100000.0,YEARLY,USD,BASE_SALARY
3,4,3884911725,200000.0,NaN,10000.0,YEARLY,USD,BASE_SALARY
4,5,3887473220,35.0,NaN,33.0,HOURLY,USD,BASE_SALARY

### 2.4 Mapping/Lookup Tables

In [16]:
# Industries mapping
industries = pd.read_csv(os.path.join(base_path, 'mappings/industries.csv'))
print(f"Industries shape: {industries.shape}")
print(f"Columns: {list(industries.columns)}")
industries.head()

Industries shape: (422, 2)
Columns: ['industry_id', 'industry_name']

   industry_id                         industry_name
0            1       Defense and Space Manufacturing
1            3       Computer Hardware Manufacturing
2            4                  Software Development
3            5          Computer Networking Products
4            6  Technology, Information and Internet

In [17]:
# Skills mapping
skills = pd.read_csv(os.path.join(base_path, 'mappings/skills.csv'))
print(f"Skills shape: {skills.shape}")
print(f"Columns: {list(skills.columns)}")
skills.head()

Skills shape: (35, 2)
Columns: ['skill_abr', 'skill_name']

  skill_abr          skill_name
0       ART        Art/Creative
1      DSGN              Design
2      ADVR         Advertising
3      PRDM  Product Management
4      DIST        Distribution

## 3. Identify Key Relationships and Possible Joins

### Primary Keys and Foreign Keys:

Based on typical LinkedIn job posting dataset structure:

1. **postings.csv** (Main table)
   - Primary Key: `job_id`
   - Foreign Key: `company_id` → links to companies.csv

2. **companies.csv**
   - Primary Key: `company_id`

3. **company_industries.csv**
   - Foreign Key: `company_id` → links to companies.csv
   - Foreign Key: `industry_id` → links to industries.csv (mapping table)

4. **company_specialities.csv**
   - Foreign Key: `company_id` → links to companies.csv

5. **employee_counts.csv**
   - Foreign Key: `company_id` → links to companies.csv

6. **benefits.csv**
   - Foreign Key: `job_id` → links to postings.csv

7. **job_industries.csv**
   - Foreign Key: `job_id` → links to postings.csv
   - Foreign Key: `industry_id` → links to industries.csv (mapping table)

8. **job_skills.csv**
   - Foreign Key: `job_id` → links to postings.csv
   - Foreign Key: `skill_abr` → links to skills.csv (mapping table)

9. **salaries.csv**
   - Foreign Key: `job_id` → links to postings.csv

In [18]:
# Verify the actual column names to confirm join keys
print("Key columns for joins:\n")
print(f"Postings key columns: {[col for col in postings.columns if 'id' in col.lower()]}")
print(f"Companies key columns: {[col for col in companies.columns if 'id' in col.lower()]}")
print(f"Job Skills key columns: {[col for col in job_skills.columns if 'id' in col.lower() or 'skill' in col.lower()]}")
print(f"Skills mapping key columns: {[col for col in skills.columns]}")

Key columns for joins:

Postings key columns: ['job_id', 'company_id']
Companies key columns: ['company_id']
Job Skills key columns: ['job_id', 'skill_abr']
Skills mapping key columns: ['skill_abr', 'skill_name']

## 4. Potential Merge/Join Scenarios

### Scenario 1: Complete Job Posting with Company Info

In [19]:
# Merge postings with company information
# This gives us job details along with company context
postings_with_company = postings.merge(
    companies, 
    on='company_id', 
    how='left',
    suffixes=('_job', '_company')
)
print(f"Postings with Company Info shape: {postings_with_company.shape}")
print(f"Columns: {list(postings_with_company.columns)}")
postings_with_company.head()

Postings with Company Info shape: (123849, 40)
Columns: ['job_id', 'company_name', 'title', 'description_job', 'max_salary', 'pay_period', 'location', 'company_id', 'views', 'med_salary', 'min_salary', 'formatted_work_type', 'applies', 'original_listed_time', 'remote_allowed', 'job_posting_url', 'application_url', 'application_type', 'expiry', 'closed_time', 'formatted_experience_level', 'skills_desc', 'listed_time', 'posting_domain', 'sponsored', 'work_type', 'currency', 'compensation_type', 'normalized_salary', 'zip_code_job', 'fips', 'name', 'description_company', 'company_size', 'state', 'country', 'city', 'zip_code_company', 'address', 'url']

,job_id,company_name,title,description_job,max_salary,pay_period,location,company_id,views,med_salary,...,fips,name,description_company,company_size,state,country,city,zip_code_company,address,url
0,921716,Corcoran Sawyer Smith,Marketing Coordinator,Job descriptionA leading real estate firm in N...,20.0,HOURLY,"Princeton, NJ",2774458.0,20.0,NaN,...,34021.0,Corcoran Sawyer Smith,With years of experience helping local buyers ...,2.0,NJ,US,Jersey City,07302,242 Tenth Street,https://www.linkedin.com/company/corcoran-sawy...
1,1829192,NaN,Mental Health Therapist/Counselor,"At Aspen Therapy and Wellness , we are committ...",50.0,HOURLY,"Fort Collins, CO",NaN,1.0,NaN,...,8069.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,10998357,The National Exemplar,Assitant Restaurant Manager,The National Exemplar is accepting application...,65000.0,YEARLY,"Cincinnati, OH",64896719.0,8.0,NaN,...,39061.0,The National Exemplar,"In April of 1983, The National Exemplar began ...",1.0,Ohio,US,Mariemont,45227,6880 Wooster Pike,https://www.linkedin.com/company/the-national-...
3,23221523,"Abrams Fensterman, LLP",Senior Elder Law / Trusts and Estates Associat...,Senior Associate Attorney - Elder Law / Trusts...,175000.0,YEARLY,"New Hyde Park, NY",766262.0,16.0,NaN,...,36059.0,"Abrams Fensterman, LLP","Abrams Fensterman, LLP is a full-service law f...",2.0,New York,US,Lake Success,11042,3 Dakota Drive,https://www.linkedin.com/company/abrams-fenste...
4,35982263,NaN,Service Technician,Looking for HVAC service tech with experience ...,80000.0,YEARLY,"Burlington, IA",NaN,3.0,NaN,...,19057.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

### Scenario 2: Job Postings with Skills

In [20]:
# First merge job_skills with skills mapping to get skill names
job_skills_detailed = job_skills.merge(
    skills,
    on='skill_abr',
    how='left'
)

# Then merge with postings
postings_with_skills = postings.merge(
    job_skills_detailed,
    on='job_id',
    how='left'
)
print(f"Postings with Skills shape: {postings_with_skills.shape}")
postings_with_skills.head()

Postings with Skills shape: (207531, 33)

,job_id,company_name,title,description,max_salary,pay_period,location,company_id,views,med_salary,...,posting_domain,sponsored,work_type,currency,compensation_type,normalized_salary,zip_code,fips,skill_abr,skill_name
0,921716,Corcoran Sawyer Smith,Marketing Coordinator,Job descriptionA leading real estate firm in N...,20.0,HOURLY,"Princeton, NJ",2774458.0,20.0,NaN,...,NaN,0,FULL_TIME,USD,BASE_SALARY,38480.0,8540.0,34021.0,MRKT,Marketing
1,921716,Corcoran Sawyer Smith,Marketing Coordinator,Job descriptionA leading real estate firm in N...,20.0,HOURLY,"Princeton, NJ",2774458.0,20.0,NaN,...,NaN,0,FULL_TIME,USD,BASE_SALARY,38480.0,8540.0,34021.0,SALE,Sales
2,1829192,NaN,Mental Health Therapist/Counselor,"At Aspen Therapy and Wellness , we are committ...",50.0,HOURLY,"Fort Collins, CO",NaN,1.0,NaN,...,NaN,0,FULL_TIME,USD,BASE_SALARY,83200.0,80521.0,8069.0,HCPR,Health Care Provider
3,10998357,The National Exemplar,Assitant Restaurant Manager,The National Exemplar is accepting application...,65000.0,YEARLY,"Cincinnati, OH",64896719.0,8.0,NaN,...,NaN,0,FULL_TIME,USD,BASE_SALARY,55000.0,45202.0,39061.0,MGMT,Management
4,10998357,The National Exemplar,Assitant Restaurant Manager,The National Exemplar is accepting application...,65000.0,YEARLY,"Cincinnati, OH",64896719.0,8.0,NaN,...,NaN,0,FULL_TIME,USD,BASE_SALARY,55000.0,45202.0,39061.0,MNFC,Manufacturing

### Scenario 3: Job Postings with Salary Information

In [21]:
# Merge postings with salary data
postings_with_salary = postings.merge(
    salaries,
    on='job_id',
    how='left'
)
print(f"Postings with Salary shape: {postings_with_salary.shape}")
postings_with_salary.head()

Postings with Salary shape: (123849, 38)

,job_id,company_name,title,description,max_salary_x,pay_period_x,location,company_id,views,med_salary_x,...,normalized_salary,zip_code,fips,salary_id,max_salary_y,med_salary_y,min_salary_y,pay_period_y,currency_y,compensation_type_y
0,921716,Corcoran Sawyer Smith,Marketing Coordinator,Job descriptionA leading real estate firm in N...,20.0,HOURLY,"Princeton, NJ",2774458.0,20.0,NaN,...,38480.0,8540.0,34021.0,18531.0,20.0,NaN,17.0,HOURLY,USD,BASE_SALARY
1,1829192,NaN,Mental Health Therapist/Counselor,"At Aspen Therapy and Wellness , we are committ...",50.0,HOURLY,"Fort Collins, CO",NaN,1.0,NaN,...,83200.0,80521.0,8069.0,8059.0,50.0,NaN,30.0,HOURLY,USD,BASE_SALARY
2,10998357,The National Exemplar,Assitant Restaurant Manager,The National Exemplar is accepting application...,65000.0,YEARLY,"Cincinnati, OH",64896719.0,8.0,NaN,...,55000.0,45202.0,39061.0,14949.0,65000.0,NaN,45000.0,YEARLY,USD,BASE_SALARY
3,23221523,"Abrams Fensterman, LLP",Senior Elder Law / Trusts and Estates Associat...,Senior Associate Attorney - Elder Law / Trusts...,175000.0,YEARLY,"New Hyde Park, NY",766262.0,16.0,NaN,...,157500.0,11040.0,36059.0,11204.0,175000.0,NaN,140000.0,YEARLY,USD,BASE_SALARY
4,35982263,NaN,Service Technician,Looking for HVAC service tech with experience ...,80000.0,YEARLY,"Burlington, IA",NaN,3.0,NaN,...,70000.0,52601.0,19057.0,20809.0,80000.0,NaN,60000.0,YEARLY,USD,BASE_SALARY

### Scenario 4: Complete Dataset - All Information Combined

In [22]:
# Create a comprehensive dataset with all key information
# Start with postings as base
complete_data = postings.copy()

# Add company info
complete_data = complete_data.merge(
    companies,
    on='company_id',
    how='left',
    suffixes=('', '_company')
)

# Add salary info
complete_data = complete_data.merge(
    salaries,
    on='job_id',
    how='left',
    suffixes=('', '_salary')
)

# Add benefits
complete_data = complete_data.merge(
    benefits,
    on='job_id',
    how='left',
    suffixes=('', '_benefit')
)

print(f"Complete dataset shape: {complete_data.shape}")
print(f"\nColumns: {list(complete_data.columns)}")
complete_data.head()

Complete dataset shape: (160507, 49)

Columns: ['job_id', 'company_name', 'title', 'description', 'max_salary', 'pay_period', 'location', 'company_id', 'views', 'med_salary', 'min_salary', 'formatted_work_type', 'applies', 'original_listed_time', 'remote_allowed', 'job_posting_url', 'application_url', 'application_type', 'expiry', 'closed_time', 'formatted_experience_level', 'skills_desc', 'listed_time', 'posting_domain', 'sponsored', 'work_type', 'currency', 'compensation_type', 'normalized_salary', 'zip_code', 'fips', 'name', 'description_company', 'company_size', 'state', 'country', 'city', 'zip_code_company', 'address', 'url', 'salary_id', 'max_salary_salary', 'med_salary_salary', 'min_salary_salary', 'pay_period_salary', 'currency_salary', 'compensation_type_salary', 'inferred', 'type']

,job_id,company_name,title,description,max_salary,pay_period,location,company_id,views,med_salary,...,url,salary_id,max_salary_salary,med_salary_salary,min_salary_salary,pay_period_salary,currency_salary,compensation_type_salary,inferred,type
0,921716,Corcoran Sawyer Smith,Marketing Coordinator,Job descriptionA leading real estate firm in N...,20.0,HOURLY,"Princeton, NJ",2774458.0,20.0,NaN,...,https://www.linkedin.com/company/corcoran-sawy...,18531.0,20.0,NaN,17.0,HOURLY,USD,BASE_SALARY,NaN,NaN
1,1829192,NaN,Mental Health Therapist/Counselor,"At Aspen Therapy and Wellness , we are committ...",50.0,HOURLY,"Fort Collins, CO",NaN,1.0,NaN,...,NaN,8059.0,50.0,NaN,30.0,HOURLY,USD,BASE_SALARY,NaN,NaN
2,10998357,The National Exemplar,Assitant Restaurant Manager,The National Exemplar is accepting application...,65000.0,YEARLY,"Cincinnati, OH",64896719.0,8.0,NaN,...,https://www.linkedin.com/company/the-national-...,14949.0,65000.0,NaN,45000.0,YEARLY,USD,BASE_SALARY,NaN,NaN
3,23221523,"Abrams Fensterman, LLP",Senior Elder Law / Trusts and Estates Associat...,Senior Associate Attorney - Elder Law / Trusts...,175000.0,YEARLY,"New Hyde Park, NY",766262.0,16.0,NaN,...,https://www.linkedin.com/company/abrams-fenste...,11204.0,175000.0,NaN,140000.0,YEARLY,USD,BASE_SALARY,1.0,401(k)
4,35982263,NaN,Service Technician,Looking for HVAC service tech with experience ...,80000.0,YEARLY,"Burlington, IA",NaN,3.0,NaN,...,NaN,20809.0,80000.0,NaN,60000.0,YEARLY,USD,BASE_SALARY,NaN,NaN

### Scenario 5: Company Analysis with Employee Counts and Industries

In [25]:
# Debug: Check the actual columns in each dataframe to understand the KeyError
print("Companies columns:", companies.columns.tolist())
print("\nEmployee counts columns:", employee_counts.columns.tolist()) 
print("\nCompany industries columns:", company_industries.columns.tolist())
print("\nIndustries columns:", industries.columns.tolist())

# Check a few sample rows to understand the data structure
print("\nCompany industries sample:")
print(company_industries.head())
print("\nIndustries sample:")
print(industries.head())

Companies columns: ['company_id', 'name', 'description', 'company_size', 'state', 'country', 'city', 'zip_code', 'address', 'url']

Employee counts columns: ['company_id', 'employee_count', 'follower_count', 'time_recorded']

Company industries columns: ['company_id', 'industry']

Industries columns: ['industry_id', 'industry_name']

Company industries sample:
   company_id                        industry
0      391906  Book and Periodical Publishing
1    22292832                    Construction
2       20300                         Banking
3     3570660  Book and Periodical Publishing
4      878353         Staffing and Recruiting

Industries sample:
   industry_id                         industry_name
0            1       Defense and Space Manufacturing
1            3       Computer Hardware Manufacturing
2            4                  Software Development
3            5          Computer Networking Products
4            6  Technology, Information and Internet

In [27]:
# Company-centric view
# Fixed: Use the correct column names for merging
company_analysis = companies.merge(
    employee_counts,
    on='company_id',
    how='left'
).merge(
    company_industries,
    on='company_id',
    how='left'
).merge(
    industries,
    left_on='industry',  # company_industries has 'industry' column
    right_on='industry_name',  # industries has 'industry_name' column
    how='left'
)

print(f"Company Analysis shape: {company_analysis.shape}")
company_analysis.head()

Company Analysis shape: (39583, 16)

,company_id,name,description,company_size,state,country,city,zip_code,address,url,employee_count,follower_count,time_recorded,industry,industry_id,industry_name
0,1009,IBM,"At IBM, we do more than work. We create. We cr...",7.0,NY,US,"Armonk, New York",10504,International Business Machines Corp.,https://www.linkedin.com/company/ibm,314102,16253625,1712378162,IT Services and IT Consulting,96.0,IT Services and IT Consulting
1,1009,IBM,"At IBM, we do more than work. We create. We cr...",7.0,NY,US,"Armonk, New York",10504,International Business Machines Corp.,https://www.linkedin.com/company/ibm,313142,16309464,1713392385,IT Services and IT Consulting,96.0,IT Services and IT Consulting
2,1009,IBM,"At IBM, we do more than work. We create. We cr...",7.0,NY,US,"Armonk, New York",10504,International Business Machines Corp.,https://www.linkedin.com/company/ibm,313147,16309985,1713402495,IT Services and IT Consulting,96.0,IT Services and IT Consulting
3,1009,IBM,"At IBM, we do more than work. We create. We cr...",7.0,NY,US,"Armonk, New York",10504,International Business Machines Corp.,https://www.linkedin.com/company/ibm,311223,16314846,1713501255,IT Services and IT Consulting,96.0,IT Services and IT Consulting
4,1016,GE HealthCare,Every day millions of people feel the impact o...,7.0,0,US,Chicago,0,-,https://www.linkedin.com/company/gehealthcare,56873,2185368,1712382540,Hospitals and Health Care,14.0,Hospitals and Health Care

In [28]:
# Check the merged data quality and show key columns
print("Company Analysis - Key Information:")
print(f"Total rows: {len(company_analysis)}")
print(f"Companies with employee counts: {company_analysis['employee_count'].notna().sum()}")
print(f"Companies with industries: {company_analysis['industry'].notna().sum()}")
print(f"Companies with industry IDs: {company_analysis['industry_id'].notna().sum()}")

# Show key columns
key_columns = ['name', 'company_size', 'country', 'employee_count', 'industry', 'industry_name']
print(f"\nSample of key columns:")
company_analysis[key_columns].head(10)

Company Analysis - Key Information:
Total rows: 39583
Companies with employee counts: 39583
Companies with industries: 35707
Companies with industry IDs: 39582

Sample of key columns:

,name,company_size,country,employee_count,industry,industry_name
0,IBM,7.0,US,314102,IT Services and IT Consulting,IT Services and IT Consulting
1,IBM,7.0,US,313142,IT Services and IT Consulting,IT Services and IT Consulting
2,IBM,7.0,US,313147,IT Services and IT Consulting,IT Services and IT Consulting
3,IBM,7.0,US,311223,IT Services and IT Consulting,IT Services and IT Consulting
4,GE HealthCare,7.0,US,56873,Hospitals and Health Care,Hospitals and Health Care
5,GE HealthCare,7.0,US,56915,Hospitals and Health Care,Hospitals and Health Care
6,GE HealthCare,7.0,US,56909,Hospitals and Health Care,Hospitals and Health Care
7,GE HealthCare,7.0,US,56943,Hospitals and Health Care,Hospitals and Health Care
8,GE HealthCare,7.0,US,56926,Hospitals and Health Care,Hospitals and Health Care
9,GE HealthCare,7.0,US,56942,Hospitals and Health Care,Hospitals and Health Care

## 5. Summary of Relationships

### Entity Relationship Diagram (Conceptual):

```
postings (1) ──── (many) job_skills ──── (many) skills
    │
    ├──── (1:1) salaries
    │
    ├──── (many) benefits
    │
    ├──── (many) job_industries ──── (many) industries
    │
    └──── (many:1) companies
                      │
                      ├──── (many) company_industries ──── (many) industries
                      │
                      ├──── (many) company_specialities
                      │
                      └──── (1:1) employee_counts
```

### Join Recommendations:

1. **For Skill Evolution Analysis**: Join postings → job_skills → skills
2. **For Salary Trends**: Join postings → salaries → companies
3. **For Company Analysis**: Join companies → employee_counts → company_industries → industries
4. **For Complete Job Market View**: Join postings → companies → salaries → job_skills → skills
5. **For Industry Trends**: Join postings → job_industries → industries

In [29]:
# Check data quality - missing values and cardinality
print("Data Quality Summary:\n")
print(f"Total postings: {len(postings)}")
print(f"Unique companies: {postings['company_id'].nunique()}")
print(f"Postings with salaries: {len(salaries)}")
print(f"Postings with skills: {job_skills['job_id'].nunique()}")
print(f"Total skill mentions: {len(job_skills)}")
print(f"Unique skills: {len(skills)}")
print(f"Unique industries: {len(industries)}")

Data Quality Summary:

Total postings: 123849
Unique companies: 24474
Postings with salaries: 40785
Postings with skills: 126807
Total skill mentions: 213768
Unique skills: 35
Unique industries: 422